# StructWallAnalyticalErrorConversion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..StructWallAnalyticalErrorConversion Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Can't convert Edges to Analytical Model curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructWallAnalyticalErrorConversion { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructWallAnalyticalErrorConversion As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructWallAnalyticalErrorConversion {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace